apache/nuttx/arch/renesas/src/rx65n/rx65n_serial.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <semaphore.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <stdio.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include "rx65n_macrodriver.h"
#include "arch/rx65n/iodefine.h"
#include "chip.h"
#include "renesas_internal.h"
#include "rx65n_definitions.h"
#include "rx65n_sci.h"
#include "arch/rx65n/irq.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some sanity checks *******************************************************/

#ifdef USE_SERIALDRIVER

/* Which SCI with be tty0/console and which tty1? */

#ifdef CONFIG_RX65N_SCI0
#  define TTYS0_DEV     g_sci0port       /* SCI0 is tty0 */
#else
#  undef  TTYS0_DEV                      /* No tty0 */
#endif
#ifdef CONFIG_RX65N_SCI1
#  define TTYS1_DEV     g_sci1port       /* SCI1 is tty1 */
#else
#  undef  TTYS1_DEV                      /* No tty1 */
#endif
#ifdef CONFIG_RX65N_SCI2
#  define TTYS2_DEV     g_sci2port       /* SCI2 is tty2 */
#else
#  undef  TTYS2_DEV                      /* No tty2 */
#endif
#ifdef CONFIG_RX65N_SCI3
#  define TTYS3_DEV     g_sci3port       /* SCI3 is tty3 */
#else
#  undef  TTYS3_DEV                      /* No tty3 */
#endif
#ifdef CONFIG_RX65N_SCI4
#  define TTYS4_DEV     g_sci4port       /* SCI4 is tty4 */
#else
#  undef  TTYS4_DEV                      /* No tty4 */
#endif
#ifdef CONFIG_RX65N_SCI5
#  define TTYS5_DEV     g_sci5port       /* SCI5 is tty5 */
#else
#  undef  TTYS5_DEV                      /* No tty5 */
#endif
#ifdef CONFIG_RX65N_SCI6
#  define TTYS6_DEV     g_sci6port       /* SCI6 is tty6 */
#else
#  undef  TTYS6_DEV                      /* No tty6 */
#endif
#ifdef CONFIG_RX65N_SCI7
#  define TTYS7_DEV     g_sci7port       /* SCI7 is tty7 */
#else
#  undef  TTYS7_DEV                      /* No tty7 */
#endif
#ifdef CONFIG_RX65N_SCI8
#  define TTYS8_DEV     g_sci8port       /* SCI8 is tty8 */
#else
#  undef  TTYS8_DEV                      /* No tty8 */
#endif
#ifdef CONFIG_RX65N_SCI9
#  define TTYS9_DEV     g_sci9port       /* SCI9 is tty9 */
#else
#  undef  TTYS9_DEV                      /* No tty9 */
#endif
#ifdef CONFIG_RX65N_SCI10
#  define TTYS10_DEV    g_sci10port      /* SCI10 is tty10 */
#else
#  undef  TTYS10_DEV                     /* No tty10 */
#endif
#ifdef CONFIG_RX65N_SCI11
#  define TTYS11_DEV    g_sci11port      /* SCI11 is tty11 */
#else
#  undef  TTYS11_DEV                     /* No tty11 */
#endif
#ifdef CONFIG_RX65N_SCI12
#  define TTYS12_DEV    g_sci12port      /* SCI12 is tty12 */
#else
#  undef  TTYS12_DEV                     /* No tty12 */
#endif

#if   defined(CONFIG_SCI0_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI0)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci0port /* SCI0 is console */
#elif defined(CONFIG_SCI1_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI1)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci1port /* SCI1 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS1_DEV
#    define     TTYS1_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV

#elif defined(CONFIG_SCI2_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI2)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci2port /* SCI2 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS2_DEV
#    define     TTYS2_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI3_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI3)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci3port /* SCI3 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS3_DEV
#    define     TTYS3_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI4_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI4)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci4port /* SCI4 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS4_DEV
#    define     TTYS4_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI5_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI5)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci5port /* SCI5 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS5_DEV
#    define     TTYS5_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI6_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI6)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci6port /* SCI6 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS6_DEV
#    define     TTYS6_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI7_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI7)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci7port /* SCI7 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS7_DEV
#    define     TTYS7_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI8_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI8)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci8port /* SCI8 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS8_DEV
#    define     TTYS8_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI9_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI9)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci9port /* SCI9 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS9_DEV
#    define     TTYS9_DEV               g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI10_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI10)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci10port /* SCI10 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS10_DEV
#    define     TTYS10_DEV              g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI11_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI11)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci11port /* SCI11 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS11_DEV
#    define     TTYS11_DEV              g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#elif defined(CONFIG_SCI12_SERIAL_CONSOLE) && defined(CONFIG_RX65N_SCI12)
#  define       HAVE_CONSOLE
#  define       CONSOLE_DEV             g_sci12port   /* SCI12 is console */
#  ifdef        TTYS0_DEV
#    undef      TTYS12_DEV
#    define     TTYS12_DEV              g_sci0port
#    undef      TTYS0_DEV
#  endif /* TTYS0_DEV */

#  define       TTYS0_DEV               CONSOLE_DEV
#else
#  undef        HAVE_CONSOLE
#  undef        CONSOLE_DEV     /* No console */
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
  uint32_t scibase;      /* Base address of SCI registers */
  uint32_t baud;         /* Configured baud */
  volatile  uint8_t scr; /* Saved SCR value */
  volatile  uint8_t ssr; /* Saved SR value */
  uint8_t xmitirq;       /* Base IRQ associated with xmit IRQ */
  uint8_t recvirq;       /* Base IRQ associated with receive IRQ */
  uint8_t eriirq;
  uint8_t teiirq;
  uint32_t grpibase;
  uint32_t erimask;
  uint32_t teimask;
  uint8_t parity; /* 0=none, 1=odd, 2=even */
  uint8_t bits;   /* Number of bits (7 or 8) */
  bool stopbits2; /* true: Configure with 2 stop bits instead of 1 */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

