apache/nuttx/arch/renesas/src/rx65n/rx65n_serial.c
static int  up_setup(struct uart_dev_s *dev);
static void up_shutdown(struct uart_dev_s *dev);
static int  up_attach(struct uart_dev_s *dev);
static void up_detach(struct uart_dev_s *dev);
static int  up_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  up_xmtinterrupt(int irq, void *context, void *arg);
static int  up_rcvinterrupt(int irq, void *context, void *arg);
static int  up_eriinterrupt(int irq, void *context, void *arg);
static int  up_teiinterrupt(int irq, void *context, void *arg);
static int  up_receive(struct uart_dev_s *dev, unsigned int *status);
static void up_rxint(struct uart_dev_s *dev, bool enable);
static bool up_rxavailable(struct uart_dev_s *dev);
static void up_send(struct uart_dev_s *dev, int ch);
static void up_txint(struct uart_dev_s *dev, bool enable);
static bool up_txready(struct uart_dev_s *dev);

/****************************************************************************
 * Public Functions
 ****************************************************************************/

void up_enable_irq(int irq);
void up_disable_irq(int irq);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I/O buffers */

#ifdef CONFIG_RX65N_SCI0
  static char g_sci0rxbuffer[CONFIG_SCI0_RXBUFSIZE];
  static char g_sci0txbuffer[CONFIG_SCI0_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI1
  static char g_sci1rxbuffer[CONFIG_SCI1_RXBUFSIZE];
  static char g_sci1txbuffer[CONFIG_SCI1_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI2
  static char g_sci2rxbuffer[CONFIG_SCI2_RXBUFSIZE];
  static char g_sci2txbuffer[CONFIG_SCI2_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI3
  static char g_sci3rxbuffer[CONFIG_SCI3_RXBUFSIZE];
  static char g_sci3txbuffer[CONFIG_SCI3_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI4
  static char g_sci4rxbuffer[CONFIG_SCI4_RXBUFSIZE];
  static char g_sci4txbuffer[CONFIG_SCI4_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI5
  static char g_sci5rxbuffer[CONFIG_SCI5_RXBUFSIZE];
  static char g_sci5txbuffer[CONFIG_SCI5_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI6
  static char g_sci6rxbuffer[CONFIG_SCI6_RXBUFSIZE];
  static char g_sci6txbuffer[CONFIG_SCI6_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI7
  static char g_sci7rxbuffer[CONFIG_SCI7_RXBUFSIZE];
  static char g_sci7txbuffer[CONFIG_SCI7_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI8
  static char g_sci8rxbuffer[CONFIG_SCI8_RXBUFSIZE];
  static char g_sci8txbuffer[CONFIG_SCI8_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI9
  static char g_sci9rxbuffer[CONFIG_SCI9_RXBUFSIZE];
  static char g_sci9txbuffer[CONFIG_SCI9_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI10
  static char g_sci10rxbuffer[CONFIG_SCI10_RXBUFSIZE];
  static char g_sci10txbuffer[CONFIG_SCI10_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI11
  static char g_sci11rxbuffer[CONFIG_SCI11_RXBUFSIZE];
  static char g_sci11txbuffer[CONFIG_SCI11_TXBUFSIZE];
#endif
#ifdef CONFIG_RX65N_SCI12
  static char g_sci12rxbuffer[CONFIG_SCI12_RXBUFSIZE];
  static char g_sci12txbuffer[CONFIG_SCI12_TXBUFSIZE];
#endif

struct uart_ops_s g_sci_ops =
{
  .setup       =  up_setup,
  .shutdown    =  up_shutdown,
  .attach      =  up_attach,
  .detach      =  up_detach,
  .receive     =  up_receive,
  .ioctl       =  up_ioctl,
  .rxint       =  up_rxint,
  .rxavailable =  up_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send        =  up_send,
  .txint       =  up_txint,
  .txready     =  up_txready,
  .txempty     =  up_txready,
};

#ifdef CONFIG_RX65N_SCI0
static struct up_dev_s g_sci0priv =
{
  .scibase     =  RX65N_SCI0_BASE,
  .baud        =  CONFIG_SCI0_BAUD,
  .recvirq     =  RX65N_RXI0_IRQ,
  .xmitirq     =  RX65N_TXI0_IRQ,
  .eriirq      =  RX65N_ERI0_IRQ,
  .teiirq      =  RX65N_TEI0_IRQ,
  .grpibase    =  RX65N_GRPBL0_ADDR,
  .erimask     =  RX65N_GRPBL0_ERI0_MASK,
  .teimask     =  RX65N_GRPBL0_TEI0_MASK,
  .parity      =  CONFIG_SCI0_PARITY,
  .bits        =  CONFIG_SCI0_BITS,
  .stopbits2   =  CONFIG_SCI0_2STOP,
};

static uart_dev_t g_sci0port =
{
  .recv     =
    {
      .size   = CONFIG_SCI0_RXBUFSIZE,
      .buffer = g_sci0rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI0_TXBUFSIZE,
      .buffer = g_sci0txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci0priv,
};
#endif

#ifdef CONFIG_RX65N_SCI1
static struct up_dev_s g_sci1priv =
{
  .scibase   =  RX65N_SCI1_BASE,
  .baud      =  CONFIG_SCI1_BAUD,
  .recvirq   =  RX65N_RXI1_IRQ,
  .xmitirq   =  RX65N_TXI1_IRQ,
  .eriirq    =  RX65N_ERI1_IRQ,
  .teiirq    =  RX65N_TEI1_IRQ,
  .grpibase  =  RX65N_GRPBL0_ADDR,
  .erimask   =  RX65N_GRPBL0_ERI1_MASK,
  .teimask   =  RX65N_GRPBL0_TEI1_MASK,
  .parity    =  CONFIG_SCI1_PARITY,
  .bits      =  CONFIG_SCI1_BITS,
  .stopbits2 =  CONFIG_SCI1_2STOP,
};

static uart_dev_t g_sci1port =
{
  .recv     =
    {
      .size    = CONFIG_SCI1_RXBUFSIZE,
      .buffer  = g_sci1rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI1_TXBUFSIZE,
      .buffer = g_sci1txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci1priv,
};
#endif

#ifdef CONFIG_RX65N_SCI2
static struct up_dev_s g_sci2priv =
{
  .scibase      =  RX65N_SCI2_BASE,
  .baud         =  CONFIG_SCI2_BAUD,
  .recvirq      =  RX65N_RXI2_IRQ,
  .xmitirq      =  RX65N_TXI2_IRQ,
  .eriirq       =  RX65N_ERI2_IRQ,
  .teiirq       =  RX65N_TEI2_IRQ,
  .grpibase     =  RX65N_GRPBL0_ADDR,
  .erimask      =  RX65N_GRPBL0_ERI2_MASK,
  .teimask      =  RX65N_GRPBL0_TEI2_MASK,
  .parity       =  CONFIG_SCI2_PARITY,
  .bits         =  CONFIG_SCI2_BITS,
  .stopbits2    =  CONFIG_SCI2_2STOP,
};

static uart_dev_t g_sci2port =
{
  .recv     =
    {
      .size    = CONFIG_SCI2_RXBUFSIZE,
      .buffer  = g_sci2rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI2_TXBUFSIZE,
      .buffer = g_sci2txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci2priv,
};
#endif

#ifdef CONFIG_RX65N_SCI3
static struct up_dev_s g_sci3priv =
{
  .scibase    =  RX65N_SCI3_BASE,
  .baud       =  CONFIG_SCI3_BAUD,
  .recvirq    =  RX65N_RXI3_IRQ,
  .xmitirq    =  RX65N_TXI3_IRQ,
  .eriirq     =  RX65N_ERI3_IRQ,
  .teiirq     =  RX65N_TEI3_IRQ,
  .grpibase   =  RX65N_GRPBL0_ADDR,
  .erimask    =  RX65N_GRPBL0_ERI3_MASK,
  .teimask    =  RX65N_GRPBL0_TEI3_MASK,
  .parity     =  CONFIG_SCI3_PARITY,
  .bits       =  CONFIG_SCI3_BITS,
  .stopbits2  =  CONFIG_SCI3_2STOP,
};

static uart_dev_t g_sci3port =
{
  .recv     =
    {
      .size    = CONFIG_SCI3_RXBUFSIZE,
      .buffer  = g_sci3rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI3_TXBUFSIZE,
      .buffer = g_sci3txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci3priv,
};
#endif

