apache/nuttx/arch/renesas/src/rx65n/rx65n_serial.c
#ifdef CONFIG_RX65N_SCI4
static struct up_dev_s g_sci4priv =
{
  .scibase   =  RX65N_SCI4_BASE,
  .baud      =  CONFIG_SCI4_BAUD,
  .recvirq   =  RX65N_RXI4_IRQ,
  .xmitirq   =  RX65N_TXI4_IRQ,
  .eriirq    =  RX65N_ERI4_IRQ,
  .teiirq    =  RX65N_TEI4_IRQ,
  .grpibase  =  RX65N_GRPBL0_ADDR,
  .erimask   =  RX65N_GRPBL0_ERI4_MASK,
  .teimask   =  RX65N_GRPBL0_TEI4_MASK,
  .parity    =  CONFIG_SCI4_PARITY,
  .bits      =  CONFIG_SCI4_BITS,
  .stopbits2 =  CONFIG_SCI4_2STOP,
};

static uart_dev_t g_sci4port =
{
  .recv     =
    {
      .size    = CONFIG_SCI4_RXBUFSIZE,
      .buffer  = g_sci4rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI4_TXBUFSIZE,
      .buffer = g_sci4txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci4priv,
};
#endif

#ifdef CONFIG_RX65N_SCI5
static struct up_dev_s g_sci5priv =
{
  .scibase    =  RX65N_SCI5_BASE,
  .baud       =  CONFIG_SCI5_BAUD,
  .recvirq    =  RX65N_RXI5_IRQ,
  .xmitirq    =  RX65N_TXI5_IRQ,
  .eriirq     =  RX65N_ERI5_IRQ,
  .teiirq     =  RX65N_TEI5_IRQ,
  .grpibase   =  RX65N_GRPBL0_ADDR,
  .erimask    =  RX65N_GRPBL0_ERI5_MASK,
  .teimask    =  RX65N_GRPBL0_TEI5_MASK,
  .parity     =  CONFIG_SCI5_PARITY,
  .bits       =  CONFIG_SCI5_BITS,
  .stopbits2  =  CONFIG_SCI5_2STOP,
};

static uart_dev_t g_sci5port =
{
  .recv     =
    {
      .size    = CONFIG_SCI5_RXBUFSIZE,
      .buffer  = g_sci5rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI5_TXBUFSIZE,
      .buffer = g_sci5txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci5priv,
};
#endif

#ifdef CONFIG_RX65N_SCI6
static struct up_dev_s g_sci6priv =
{
  .scibase   =  RX65N_SCI6_BASE,
  .baud      =  CONFIG_SCI6_BAUD,
  .recvirq   =  RX65N_RXI6_IRQ,
  .xmitirq   =  RX65N_TXI6_IRQ,
  .eriirq    =  RX65N_ERI6_IRQ,
  .teiirq    =  RX65N_TEI6_IRQ,
  .grpibase  =  RX65N_GRPBL0_ADDR,
  .erimask   =  RX65N_GRPBL0_ERI6_MASK,
  .teimask   =  RX65N_GRPBL0_TEI6_MASK,
  .parity    =  CONFIG_SCI6_PARITY,
  .bits      =  CONFIG_SCI6_BITS,
  .stopbits2 =  CONFIG_SCI6_2STOP,
};

static uart_dev_t g_sci6port =
{
  .recv     =
    {
      .size    = CONFIG_SCI6_RXBUFSIZE,
      .buffer  = g_sci6rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI6_TXBUFSIZE,
      .buffer = g_sci6txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci6priv,
};
#endif

#ifdef CONFIG_RX65N_SCI7
static struct up_dev_s g_sci7priv =
{
  .scibase   =  RX65N_SCI7_BASE,
  .baud      =  CONFIG_SCI7_BAUD,
  .recvirq   =  RX65N_RXI7_IRQ,
  .xmitirq   =  RX65N_TXI7_IRQ,
  .eriirq    =  RX65N_ERI7_IRQ,
  .teiirq    =  RX65N_TEI7_IRQ,
  .grpibase  =  RX65N_GRPBL0_ADDR,
  .erimask   =  RX65N_GRPBL0_ERI7_MASK,
  .teimask   =  RX65N_GRPBL0_TEI7_MASK,
  .parity    =  CONFIG_SCI7_PARITY,
  .bits      =  CONFIG_SCI7_BITS,
  .stopbits2 =  CONFIG_SCI7_2STOP,
};

static uart_dev_t g_sci7port =
{
  .recv     =
    {
      .size    = CONFIG_SCI7_RXBUFSIZE,
      .buffer  = g_sci7rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI7_TXBUFSIZE,
      .buffer = g_sci7txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci7priv,
};
#endif

#ifdef CONFIG_RX65N_SCI8
static struct up_dev_s g_sci8priv =
{
  .scibase    =  RX65N_SCI8_BASE,
  .baud       =  CONFIG_SCI8_BAUD,
  .recvirq    =  RX65N_RXI8_IRQ,
  .xmitirq    =  RX65N_TXI8_IRQ,
  .eriirq     =  RX65N_ERI8_IRQ,
  .teiirq     =  RX65N_TEI8_IRQ,
  .grpibase   =  RX65N_GRPBL1_ADDR,
  .erimask    =  RX65N_GRPBL1_ERI8_MASK,
  .teimask    =  RX65N_GRPBL1_TEI8_MASK,
  .parity     =  CONFIG_SCI8_PARITY,
  .bits       =  CONFIG_SCI8_BITS,
  .stopbits2  =  CONFIG_SCI8_2STOP,
};

static uart_dev_t g_sci8port =
{
  .recv     =
    {
      .size    = CONFIG_SCI8_RXBUFSIZE,
      .buffer  = g_sci8rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI8_TXBUFSIZE,
      .buffer = g_sci8txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci8priv,
};
#endif

#ifdef CONFIG_RX65N_SCI9
static struct up_dev_s g_sci9priv =
{
  .scibase     =  RX65N_SCI9_BASE,
  .baud        =  CONFIG_SCI9_BAUD,
  .recvirq     =  RX65N_RXI9_IRQ,
  .xmitirq     =  RX65N_TXI9_IRQ,
  .eriirq      =  RX65N_ERI9_IRQ,
  .teiirq      =  RX65N_TEI9_IRQ,
  .grpibase    =  RX65N_GRPBL1_ADDR,
  .erimask     =  RX65N_GRPBL1_ERI9_MASK,
  .teimask     =  RX65N_GRPBL1_TEI9_MASK,
  .parity      =  CONFIG_SCI9_PARITY,
  .bits        =  CONFIG_SCI9_BITS,
  .stopbits2   =  CONFIG_SCI9_2STOP,
};

static uart_dev_t g_sci9port =
{
  .recv     =
    {
      .size    = CONFIG_SCI9_RXBUFSIZE,
      .buffer  = g_sci9rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI9_TXBUFSIZE,
      .buffer = g_sci9txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci9priv,
};
#endif

#ifdef CONFIG_RX65N_SCI10
static struct up_dev_s g_sci10priv =
{
  .scibase   =  RX65N_SCI10_BASE,
  .baud      =  CONFIG_SCI10_BAUD,
  .recvirq   =  RX65N_RXI10_IRQ,
  .xmitirq   =  RX65N_TXI10_IRQ,
  .eriirq    =  RX65N_ERI10_IRQ,
  .teiirq    =  RX65N_TEI10_IRQ,
  .grpibase  =  RX65N_GRPAL0_ADDR,
  .erimask   =  RX65N_GRPAL0_ERI10_MASK,
  .teimask   =  RX65N_GRPAL0_TEI10_MASK,
  .parity    =  CONFIG_SCI10_PARITY,
  .bits      =  CONFIG_SCI10_BITS,
  .stopbits2 =  CONFIG_SCI10_2STOP,
};

static uart_dev_t g_sci10port =
{
  .recv     =
    {
      .size    = CONFIG_SCI10_RXBUFSIZE,
      .buffer  = g_sci10rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI10_TXBUFSIZE,
      .buffer = g_sci10txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci10priv,
};
#endif

#ifdef CONFIG_RX65N_SCI11
static struct up_dev_s g_sci11priv =
{
  .scibase    =  RX65N_SCI11_BASE,
  .baud       =  CONFIG_SCI11_BAUD,
  .recvirq    =  RX65N_RXI11_IRQ,
  .xmitirq    =  RX65N_TXI11_IRQ,
  .eriirq     =  RX65N_ERI11_IRQ,
  .teiirq     =  RX65N_TEI11_IRQ,
  .grpibase   =  RX65N_GRPAL0_ADDR,
  .erimask    =  RX65N_GRPAL0_ERI11_MASK,
  .teimask    =  RX65N_GRPAL0_TEI11_MASK,
  .parity     =  CONFIG_SCI11_PARITY,
  .bits       =  CONFIG_SCI11_BITS,
  .stopbits2  =  CONFIG_SCI11_2STOP,
};

