apache/nuttx/arch/renesas/src/rx65n/rx65n_serial.c
static uart_dev_t g_sci11port =
{
  .recv     =
    {
      .size    = CONFIG_SCI11_RXBUFSIZE,
      .buffer  = g_sci11rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI11_TXBUFSIZE,
      .buffer = g_sci11txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci11priv,
};
#endif

#ifdef CONFIG_RX65N_SCI12
static struct up_dev_s g_sci12priv =
{
  .scibase   =  RX65N_SCI12_BASE,
  .baud      =  CONFIG_SCI12_BAUD,
  .recvirq   =  RX65N_RXI12_IRQ,
  .xmitirq   =  RX65N_TXI12_IRQ,
  .eriirq    =  RX65N_ERI12_IRQ,
  .teiirq    =  RX65N_TEI12_IRQ,
  .grpibase  =  RX65N_GRPBL0_ADDR,
  .erimask   =  RX65N_GRPBL0_ERI12_MASK,
  .teimask   =  RX65N_GRPBL0_TEI12_MASK,
  .parity    =  CONFIG_SCI12_PARITY,
  .bits      =  CONFIG_SCI12_BITS,
  .stopbits2 =  CONFIG_SCI12_2STOP,
};

static uart_dev_t g_sci12port =
{
  .recv     =
    {
      .size    = CONFIG_SCI12_RXBUFSIZE,
      .buffer  = g_sci12rxbuffer,
    },

  .xmit     =
    {
      .size   = CONFIG_SCI12_TXBUFSIZE,
      .buffer = g_sci12txbuffer,
    },

  .ops      = &g_sci_ops,
  .priv     = &g_sci12priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint8_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg8(priv->scibase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline
void up_serialout(struct up_dev_s *priv, int offset, uint8_t value)
{
  putreg8(value, priv->scibase + offset);
}

/****************************************************************************
 * Name: up_disablesciint
 ****************************************************************************/

static inline void up_disablesciint(struct up_dev_s *priv, uint8_t *scr)
{
  if (scr)
    {
      *scr = priv->scr;
    }

  /* The disable all interrupts */

  priv->scr &= ~RX_SCISCR_ALLINTS;
  up_serialout(priv, RX_SCI_SCR_OFFSET, priv->scr);
}

/****************************************************************************
 * Name: up_restoresciint
 ****************************************************************************/

static inline void up_restoresciint(struct up_dev_s *priv, uint8_t scr)
{
  /* Set the interrupt bits in the scr value */

  priv->scr  &= ~RX_SCISCR_ALLINTS;
  priv->scr |= (scr & RX_SCISCR_ALLINTS);
  up_serialout(priv, RX_SCI_SCR_OFFSET, priv->scr);
}

/****************************************************************************
 * Name: up_waittxready
 ****************************************************************************/

#ifdef HAVE_CONSOLE
static inline void up_waittxready(struct up_dev_s *priv)
{
  int tmp;

  /* Limit how long we will wait for the TDR empty condition */

  for (tmp = 1000 ; tmp > 0 ; tmp--)
    {
      /* Check if the TDR is empty.  The TDR becomes empty when:  (1) the
       * the chip is reset or enters standby mode, (2) the TE bit in the SCR
       * is cleared, or (3) the current TDR contents are loaded in the TSR so
       * that new data can be written in the TDR.
       */

      if (0 != (up_serialin(priv, RX_SCI_SSR_OFFSET) & RX_SCISSR_TDRE))
        {
          /* The TDR is empty... return */

          break;
        }
    }
}
#endif

/****************************************************************************
 * Name: up_setbrr
 *
 * Description:
 *   Calculate the correct value for the BRR given the configured frequency
 *   and the desired BAUD settings.
 *
 ****************************************************************************/

static inline void up_setbrr(struct up_dev_s *priv, unsigned int baud)
{
  uint32_t        t_baud;
  uint32_t        t_brr1;
  uint32_t        brrdiv;
  uint32_t        t_pclk_divbrr;
  float           f_mddr;
  uint8_t         semr;
  uint8_t         mddr;
  uint8_t         brr;

  semr = up_serialin(priv, RX_SCI_SEMR_OFFSET);
  brrdiv = 32U;
  if (0U != (0x10 & semr))
    {
      brrdiv /= 2U;
    }

  if (0U != (0x40 & semr))
    {
      brrdiv /= 2U;
    }

  if ((RX65N_SCI10_BASE == priv->scibase)
      || (RX65N_SCI11_BASE == priv->scibase))
    {
      t_pclk_divbrr = RX_PCLKA / brrdiv;
    }
  else
    {
      t_pclk_divbrr = RX_PCLKB / brrdiv;
    }

  t_brr1 = t_pclk_divbrr / baud;
  t_baud = t_pclk_divbrr / t_brr1;
  while (t_baud < baud)
    {
      t_brr1--;
      t_baud = RX_PCLKB / brrdiv / t_brr1;
    }

  brr  = t_brr1 - 1;
  f_mddr = ((float)baud * 256.0f) / (float)t_baud + 0.5f;
  mddr = ((256.0f <= f_mddr) || (0.0f > f_mddr)) ? 0 : (uint8_t)f_mddr;
  if (0 < mddr)
    {
      /* BRME(0x04) = 1; */

       semr |= 0x04;
    }
  else
    {
      /* BRME(0x04) = 0; */

       semr &= 0xf1;
       mddr = 255U;
    }

  /* RXDE(0x80) = NFEN(0x20) = 1; */

  semr |= 0xa0;

  up_serialout(priv, RX_SCI_SEMR_OFFSET, semr);
  up_serialout(priv, RX_SCI_BRR_OFFSET, brr);
  up_serialout(priv, RX_SCI_MDDR_OFFSET, mddr);
}

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the SCI baud, bits, parity, fifos, etc. This
 *   method is called the first time that the serial port is
 *   opened.
 *
 ****************************************************************************/

static int up_setup(struct uart_dev_s *dev)
{
#ifndef CONFIG_SUPPRESS_SCI_CONFIG
  struct up_dev_s         *priv;
  uint8_t         smr;

  priv = (struct up_dev_s *)dev->priv;

  /* Disable the transmitter and receiver */

  priv->scr  = up_serialin(priv, RX_SCI_SCR_OFFSET);
  priv->scr &= ~(RX_SCISCR_TE | RX_SCISCR_RE);
  priv->scr &= ~RX_SCISCR_CKEMASK;
  up_serialout(priv, RX_SCI_SCR_OFFSET, priv->scr);

  /* Set communication to be asynchronous with the configured number of data
   * bits, parity, and stop bits.  Use the internal clock (undivided)
   */

  smr = 0;
  if (7 == priv->bits)
    {
      smr |= RX_SCISMR_CHR;
    }

  if (1 == priv->parity)
    {
      smr |= (RX_SCISMR_PE | RX_SCISMR_OE);
    }
  else if(2 == priv->parity)
    {
      smr |= RX_SCISMR_PE;
    }

  if (priv->stopbits2)
    {
      smr |= RX_SCISMR_STOP;
    }

  up_serialout(priv, RX_SCI_SMR_OFFSET, smr);

  /* Set the baud based on the configured console baud and configured
   * system clock.
   */

  up_setbrr(priv, priv->baud);

  /* Then enable the transmitter and receiver */

  priv->scr |= (RX_SCISCR_TE | RX_SCISCR_RE);
  up_serialout(priv, RX_SCI_SCR_OFFSET, priv->scr);
#endif
  return OK;
}

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the SCI.  This method is called when the serial port is closed
 *
 ****************************************************************************/

