apache/nuttx/arch/renesas/src/rx65n/rx65n_serial.c
static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv;

  priv = (struct up_dev_s *)dev->priv;
  up_disablesciint(priv, NULL);
  priv->scr  = up_serialin(priv, RX_SCI_SCR_OFFSET);
  priv->scr &= ~(RX_SCISCR_TE | RX_SCISCR_RE);
  up_serialout(priv, RX_SCI_SCR_OFFSET, priv->scr);
}

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the SCI to operation in interrupt driven mode.  This method is
 *   called when the serial port is opened.  Normally, this is just after the
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method
 *   (unless the
 *   hardware supports multiple levels of interrupt enabling).
 *   The RX and TX
 *   interrupts are not enabled until the txint() and rxint()
 *   methods are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv;
  int             ret;
  priv = (struct up_dev_s *)dev->priv;

  /* Attach the RDR full IRQ (RXI) that is enabled by the RIE SCR bit */

  ret = irq_attach(priv->recvirq, up_rcvinterrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the TDR empty IRQ (TXI) enabled by the TIE SCR bit */

  ret = irq_attach(priv->xmitirq, up_xmtinterrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the ERI IRQ */

  ret = irq_attach(priv->eriirq, up_eriinterrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the TEI IRQ */

  ret = irq_attach(priv->teiirq, up_teiinterrupt, dev);
  if (OK == ret)
    {
#ifdef CONFIG_ARCH_IRQPRIO
      /* All SCI0 interrupts share the same prioritization */

      up_prioritize_irq(priv->recvirq, 7);  /* Set SCI priority midway */
      up_prioritize_irq(priv->xmitirq, 7);
#endif

      /* Return OK on success */

      return OK;
    }

  irq_detach(priv->recvirq);
  irq_detach(priv->xmitirq);
  irq_detach(priv->eriirq);
  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach SCI interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.
 *   The exception is
 *   the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv;
  priv = (struct up_dev_s *)dev->priv;

  /* Disable all SCI interrupts */

  up_disablesciint(priv, NULL);

  /* Detach the SCI interrupts */

  up_disable_irq(priv->recvirq);
  up_disable_irq(priv->xmitirq);
  irq_detach(priv->recvirq);
  irq_detach(priv->xmitirq);
}

static int up_eriinterrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev;
  struct up_dev_s   *priv;
  uint32_t grpreg;
  dev = (struct uart_dev_s *)arg;
  DEBUGASSERT((NULL != dev) && (NULL != priv));
  priv = (struct up_dev_s *)dev->priv;
  grpreg = getreg32(priv->grpibase);
  if (grpreg | priv->erimask)
    {
      /* Get the current SCI status  */

      priv->ssr = up_serialin(priv, RX_SCI_SSR_OFFSET);

      /* Clear all read related events (probably already done in
       * up_receive))
       */

      priv->ssr &= ~(RX_SCISSR_ORER | RX_SCISSR_FER | RX_SCISSR_PER);
      up_serialout(priv, RX_SCI_SSR_OFFSET, priv->ssr);
    }

  return OK;
}

static int up_teiinterrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev;
  struct up_dev_s   *priv;
  uint32_t grpreg;

  dev = (struct uart_dev_s *)arg;
  DEBUGASSERT((NULL != dev) && (NULL != priv));
  priv = (struct up_dev_s *)dev->priv;
  grpreg = getreg32(priv->grpibase);
  if (grpreg | priv->teimask)
    {
      /* Get the current SCI status  */

    priv->ssr = up_serialin(priv, RX_SCI_SSR_OFFSET);

      /* Clear all read related events (probably already done in
       * up_receive))
       */

     priv->ssr &= ~(RX_SCISSR_TEND);
     up_serialout(priv, RX_SCI_SSR_OFFSET, priv->ssr);
    }

  return OK;
}

static int up_rcvinterrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev;
  dev = (struct uart_dev_s *)arg;
  DEBUGASSERT((NULL != dev));

  /* Handle receive-related events with RIE is enabled.  RIE is enabled at
   * times that driver is open EXCEPT when the driver is actively copying
   * data from the circular buffer.  In that case, the read events must
   * pend until RIE is set
   */

  uart_recvchars(dev);
  return OK;
}

/****************************************************************************
 * Name: up_xmtinterrupt
 *
 * Description:
 *   This is the SCI interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int  up_xmtinterrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev;
  dev = (struct uart_dev_s *)arg;
  DEBUGASSERT((NULL != dev));

  /* Handle outgoing, transmit bytes (TDRE: Transmit Data Register Empty)
   * when TIE is enabled.  TIE is only enabled when the driver is waiting
   * with buffered data.  Since TDRE is usually true,
   */

  uart_xmitchars(dev);
  return OK;
}

/****************************************************************************
 * Name: up_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int up_ioctl(struct file *filep, int cmd, unsigned long arg)
{
    int                ret    = OK;

    switch (cmd)
    {
#ifdef CONFIG_SERIAL_TERMIOS
#error CONFIG_SERIAL_TERMIOS NOT IMPLEMENTED
#endif /* CONFIG_SERIAL_TERMIOS */
       default:
            ret = -ENOTTY;
            break;
    }

    return ret;
}

/****************************************************************************
 * Name: up_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the SCI.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

static int up_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct up_dev_s *priv;
  uint8_t rdr;
  uint8_t ssr;
  priv = (struct up_dev_s *)dev->priv;

